<?php

return [
    'language' => 'E',
    'system' => [
        'application_name' => 'اسم النظام',
        'language' => 'اللغة',
        'style' => 'التصميم',
        'auto' => 'تلقائي',
        'dark' => 'غامق',
        'light' => 'فاتح',
        'arabic' => 'العربية',
        'english' => 'الإنجليزية',
    ],
    'auth' => [
        'forgot' => 'نسيت كلمة المرور؟',
        'create_account' => 'حساب جديد',
        'login' => 'تسجيل دخول',
        'register' => 'تسجيل',
        'agree' => 'أوافق على',
        'privacy' => 'الشروط والأحكام',
        'have_account' => 'لديك حساب؟ سجل دخولك',
        'recover_password' => 'استعادة كلمة المرور',
        'change_language' => 'Change language',
        'log_out' => 'تسجيل الخروج',
    ],
    'dashboard' => [
        'dashboard' => 'الرئيسية',
        'users' => 'المستخدمين',
        'search' => 'بحث',
        'profile' => 'بياناتي',
        'settings' => 'الإعدادات',
        'notifications' => 'الإشعارات',
        'messages' => 'الرسائل',
        'user' => 'المستخدم',
        'actions' => 'الإجراءات',
        'showing' => 'عرض',
        'of' => 'من',
        'create' => 'إنشاء',
        'update' => 'تحديث',
        'show' => 'عرض',
        'generate' => 'توليد',
        'copy_password' => 'قم بنسخ كلمة المرور قبل الموافقة على استخدامها',
        'use_it' => 'استخدمها',
        'cancel' => 'إلغاء الأمر',
        'edit' => 'تعديل',
        'show' => 'عرض',
        'back' => 'رجوع',
        'general' => 'عام',
        'roles' => 'الأدوار',
        'role' => 'الدور',
        'permissions' => 'الصلاحيات',
        'my_settings' => 'إعداداتي'
    ],
    'user' => [
        'user' => 'مستخدم'
    ],
    'role' => [
        'role' => 'دور',
    ],
    'welcome' => [
        'welcome' => 'مرحباً',
        'larvel_documentation' => 'يمتلك Laravel توثيقًا رائعًا وشاملًا يغطي كل جانب من جوانب إطار العمل. سواء كنت جديدًا في إطار العمل أو لديك خبرة سابقة مع Laravel ، نوصي بقراءة كل الوثائق من البداية إلى النهاية.',
        'laracast' => 'تقدم Laracasts آلاف مقاطع الفيديو التعليمية حول تطوير Laravel و PHP و JavaScript. تحقق منها ، وانظر بنفسك ، وارفع مستوى مهاراتك في البرمجة.',
        'laravel_news_community' => 'Laravel News عبارة عن بوابة إلكترونية ورسائل إخبارية مدفوعة تجمع كل الأخبار الخاصة بنظام Laravel، بما في ذلك إصدارات الحزم الجديدة والبرامج التعليمية.',
        'laravel_library' => 'تساعدك مكتبة Laravel القوية من أدوات ومكتبات الطرف الأول ، مثل',
        'next_level' => 'على الارتقاء بمشاريعك إلى المستوى التالي. قم بإقرانها بمكتبات قوية مفتوحة المصدر مثل',
        'and_more' => 'والمزيد.'
    ],
    'errors' => [
        503 => [
            'title' => '503: أعمال صيانة',
            'description' => 'عذرا ، نحن نقوم ببعض أعمال الصيانة. الرجاء التحقق مرة اخرى قريبا.'
        ],
        500 => [
            'title' => '500: خطأ داخلي',
            'description' => 'عفوًا ، حدث خطأ ما على خوادمنا.'
        ],
        404 => [
            'title' => '404: صفحة غير موجودة',
            'description' => 'عذرا ، الصفحة التي تبحث عنها لا يمكن العثور عليها.'],
        403 => [
            'title' => '403: دخول غير مصرح',
            'description' => 'عذرا ، لا تملك الصلاحية اللازمة للوصل لهذه الصفحة.'
        ],
    ]
];